In [1]:
import pandas as pd 
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [15]:
import pandas as pd
import numpy as np 

array1 = np.array([10,20,30,41])
array2 = np.array([60,70,98,56])
a3 = np.array([23,20,32,45])
a4= np.array([102,111])
df= pd.DataFrame([array1,array2,a3,a4],columns = ['A','B','c','D'])
print(df) 

# our dataframe is inconsistent 
df.fillna(df.mean())

     A    B     c     D
0   10   20  30.0  41.0
1   60   70  98.0  56.0
2   23   20  32.0  45.0
3  102  111   NaN   NaN

     A    B          c          D
0   10   20  30.000000  41.000000
1   60   70  98.000000  56.000000
2   23   20  32.000000  45.000000
3  102  111  53.333333  47.333333

In [16]:
import pandas as pd 
df = pd.DataFrame([{'a':10,'b':20},{'a':30,'b':40}])
print(df)

# with the help of list

    a   b
0  10  20
1  30  40

In [20]:
# dataframe is nothing but the combination of the series 

import pandas as pd
import numpy as np
s1= pd.Series(np.arange(1,5))
s2= pd.Series(np.arange(5,10))
s3= pd.Series(np.arange(10,15))
s4= pd.Series(np.arange(15,20))

df = pd.DataFrame([s1,s2,s3,s4])
print(df)

      0     1     2     3     4
0   1.0   2.0   3.0   4.0   NaN
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [35]:
result  = pd.DataFrame([{'prachi':80,'Aman':95,'Aditya':70,'Tanish':80},
                        {'prachi':70,'Aman':85,'Aditya':80,'Tanish':90},
                       {'prachi':90,'Aman':75,'Aditya':66,'Tanish':60},
                       {'prachi':85,'Aman':82,'Aditya':88,'Tanish':88}],
                       index = ['maths','science','sst','hindi'])

result['preeti'] = [90,88,56,75]
result['Tanish'] = 90

#.loc()- method helps in character indexing 
result.loc['English']=[98,20,91,0,97]
print(result)

         prachi  Aman  Aditya  Tanish  preeti
maths        80    95      70      90      90
science      70    85      80      90      88
sst          90    75      66      90      56
hindi        85    82      88      90      75
English      98    20      91       0      97

In [37]:
result  = pd.DataFrame([{'prachi':80,'Aman':95,'Aditya':70,'Tanish':80},
                        {'prachi':70,'Aman':85,'Aditya':80,'Tanish':90},
                       {'prachi':90,'Aman':75,'Aditya':66,'Tanish':60},
                       {'prachi':85,'Aman':82,'Aditya':88,'Tanish':88}],
                       index = ['maths','science','sst','hindi'])
result

         prachi  Aman  Aditya  Tanish
maths        80    95      70      80
science      70    85      80      90
sst          90    75      66      60
hindi        85    82      88      88

In [40]:
result = result.drop('science')

In [41]:
result

       prachi  Aman  Aditya  Tanish
maths      80    95      70      80
sst        90    75      66      60
hindi      85    82      88      88

In [45]:
result = result.drop(['Aditya','Tanish'],axis=1)

In [46]:
# row  = axis  = 0
# column = axis  = 1
result

       prachi  Aman
maths      80    95
sst        90    75
hindi      85    82

In [47]:
result = result.drop('hindi',axis = 0)

In [48]:
result

       prachi  Aman
maths      80    95
sst        90    75